MikroElektronika/mikrosdk_v2/targets/arm/mikroe/ai_generated/stm32/include/tim/hal_ll_tim_pin_map/implementations/doc_ds_89/hal_ll_tim_pin_map.h
    #ifdef TIM20_CH2N_PE5_AF6
    {GPIO_PE5, TIM20_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2N, 6, hal_ll_tim_module_num(TIM_MODULE_20)},
    #endif
    #ifdef TIM20_CH2_PE3_AF6
    {GPIO_PE3, TIM20_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 6, hal_ll_tim_module_num(TIM_MODULE_20)},
    #endif
    #ifdef TIM20_CH3N_PE6_AF6
    {GPIO_PE6, TIM20_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3N, 6, hal_ll_tim_module_num(TIM_MODULE_20)},
    #endif
    #ifdef TIM20_CH3_PF2_AF2
    {GPIO_PF2, TIM20_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 2, hal_ll_tim_module_num(TIM_MODULE_20)},
    #endif
    #ifdef TIM20_CH4N_PE0_AF3
    {GPIO_PE0, TIM20_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4N, 3, hal_ll_tim_module_num(TIM_MODULE_20)},
    #endif
    #ifdef TIM20_CH4_PE1_AF6
    {GPIO_PE1, TIM20_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 6, hal_ll_tim_module_num(TIM_MODULE_20)},
    #endif
    #ifdef TIM20_ETR_PE0_AF6
    // {GPIO_PE0, TIM20_BASE_ADDRESS, 0, 6, hal_ll_tim_module_num(TIM_MODULE_20)},
    #endif
    #ifdef TIM2_CH1_PD3_AF2
    {GPIO_PD3, TIM2_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 2, hal_ll_tim_module_num(TIM_MODULE_2)},
    #endif
    #ifdef TIM2_CH2_PD4_AF2
    {GPIO_PD4, TIM2_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 2, hal_ll_tim_module_num(TIM_MODULE_2)},
    #endif
    #ifdef TIM2_CH3_PD7_AF2
    {GPIO_PD7, TIM2_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 2, hal_ll_tim_module_num(TIM_MODULE_2)},
    #endif
    #ifdef TIM2_CH4_PD6_AF2
    {GPIO_PD6, TIM2_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 2, hal_ll_tim_module_num(TIM_MODULE_2)},
    #endif
    #ifdef TIM2_ETR_PD3_AF2
    // {GPIO_PD3, TIM2_BASE_ADDRESS, 0, 2, hal_ll_tim_module_num(TIM_MODULE_2)},
    #endif
    #ifdef TIM3_CH1_PE2_AF2
    {GPIO_PE2, TIM3_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 2, hal_ll_tim_module_num(TIM_MODULE_3)},
    #endif
    #ifdef TIM3_CH2_PE3_AF2
    {GPIO_PE3, TIM3_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 2, hal_ll_tim_module_num(TIM_MODULE_3)},
    #endif
    #ifdef TIM3_CH3_PE4_AF2
    {GPIO_PE4, TIM3_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 2, hal_ll_tim_module_num(TIM_MODULE_3)},
    #endif
    #ifdef TIM3_CH4_PE5_AF2
    {GPIO_PE5, TIM3_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 2, hal_ll_tim_module_num(TIM_MODULE_3)},
    #endif
    #ifdef TIM4_CH1_PD12_AF2
    {GPIO_PD12, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_1, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH2_PD13_AF2
    {GPIO_PD13, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_2, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH3_PD14_AF2
    {GPIO_PD14, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_3, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_CH4_PD15_AF2
    {GPIO_PD15, TIM4_BASE_ADDRESS, HAL_LL_TIM_CHANNEL_4, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    #ifdef TIM4_ETR_PE0_AF2
    // {GPIO_PE0, TIM4_BASE_ADDRESS, 0, 2, hal_ll_tim_module_num(TIM_MODULE_4)},
    #endif
    { HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR, HAL_LL_CHANNEL_ERROR, HAL_LL_PIN_NC, HAL_LL_PIN_NC }
};

#ifdef __cplusplus
}
#endif

#endif // _HAL_LL_TIM_PIN_MAP_H_
// ------------------------------------------------------------------------- END
